app/controllers/accounts_controller.rb

  def create
  	@account = Account.new(account_params)
  	if @account.save
---
INSERT INTO "accounts" ("created_at", "owner_id", "subdomain", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-05-28 14:31:03.964253"], ["owner_id", 21], ["subdomain", "test_subdomain"], ["updated_at", "2014-05-28 14:31:03.964253"]]